<?php
return [
    'fullName' => "الاسم بالكامل",
    'birthdate' => "تاريخ الميلاد",
    'actorBtn' => "ممثلين",
    'password' => "كلمة المرور",
    'username' => "اسم المستخدم",
    'phone' => "رقم الهاتف",
    'confirmPassword' => "تأكيد كلمة المرور",
    'email' => "البريد الالكتروني",
    'address' => "العنوان",
    'register' => "تسجيل",
    'registering' => "جاري التسجيل...",

    'plcFullName' => " الاسم بالكامل",
    'plcBirthdate' => " تاريخ الميلاد",
    'plcPassword' => " كلمة المرور",
    'plcUsername' => " اسم المستخدم",
    'plcPhone' => " رقم الهاتف",
    'plcConfirmPassword' => " تأكيد كلمة المرور",
    'plcEmail' => " بريدك الالكتروني",
    'plcAddress' => " العنوان الخاص بك",

    'modalTitle' => 'ممثلين ولدوا في نفس اليوم الذي ولدت فيه',
    'modalClose' => 'إغلاق',
    'modalMessage' => 'من فضلك اختر تاريخ ميلادك لترى الممثلين الذين ولدوا في نفس اليوم الذي ولدت فيه',

    'allFieldsRequired' => 'كل الحقول مطلوبة',
    'passwordsNotMatch' => 'كلمة المرور غير متطابقة',
    'fullNameError' => 'الاسم الكامل يمكن أن يحتوي فقط على حروف ومسافات',
    'phoneError' => 'من فضلك أدخل رقم هاتف صحيح مكون من 11 رقم',
    'passwordError' => 'كلمة المرور يجب أن تكون على الأقل 8 أحرف مع رقم واحد على الأقل وحرف خاص واحد',
    'emailError' => 'من فضلك أدخل بريد إلكتروني صحيح',

    'error' => 'خطأ!',
];
